In [2]:
import pandas as pd
import numpy as np

In [35]:
data = pd.read_csv('Dataset.csv')
data.head(10)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [36]:
x = data.drop(['Purchased'], axis =1)
y = data['Purchased']
x.shape, y.shape

((10, 3), (10,))

In [37]:
x.dtypes

Country     object
Age        float64
Salary     float64
dtype: object

In [38]:
mean_age = np.mean(x['Age'])
mean_age

38.77777777777778

In [39]:
x['Age'].fillna(mean_age, inplace= True)

In [40]:
mean_salary = np.mean(x['Salary'])
mean_salary

63777.77777777778

In [41]:
x['Salary'].fillna(mean_salary, inplace = True)

In [42]:
x.isnull().sum()

Country    0
Age        0
Salary     0
dtype: int64

In [43]:
x.head(10)

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  54000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  63777.777778
5   France  35.000000  58000.000000
6    Spain  38.777778  52000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

In [44]:
x = pd.get_dummies(x)
x.head(10)

         Age        Salary  Country_France  Country_Germany  Country_Spain
0  44.000000  72000.000000               1                0              0
1  27.000000  48000.000000               0                0              1
2  30.000000  54000.000000               0                1              0
3  38.000000  61000.000000               0                0              1
4  40.000000  63777.777778               0                1              0
5  35.000000  58000.000000               1                0              0
6  38.777778  52000.000000               0                0              1
7  48.000000  79000.000000               1                0              0
8  50.000000  83000.000000               0                1              0
9  37.000000  67000.000000               1                0              0

In [45]:
y.head(10)

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [46]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
y = pd.DataFrame({
    'Purchased': le.fit_transform(y)
})
y.head(10)

   Purchased
0          0
1          1
2          0
3          0
4          1
5          1
6          0
7          1
8          0
9          1

In [47]:
from sklearn.model_selection import train_test_split as tts

train_x, test_x, train_y, test_y = tts(x, y, test_size = 0.2, random_state = 1)

In [49]:
train_x.head()

         Age        Salary  Country_France  Country_Germany  Country_Spain
6  38.777778  52000.000000               0                0              1
4  40.000000  63777.777778               0                1              0
0  44.000000  72000.000000               1                0              0
3  38.000000  61000.000000               0                0              1
1  27.000000  48000.000000               0                0              1

In [50]:
test_x.head()

    Age   Salary  Country_France  Country_Germany  Country_Spain
2  30.0  54000.0               0                1              0
9  37.0  67000.0               1                0              0

In [51]:
train_y.head()

   Purchased
6          0
4          1
0          0
3          0
1          1

In [52]:
test_y.head()

   Purchased
2          0
9          1